Revit 2027 API
EnergyDataSettings.ShadeDepth Property
Note: This API is now obsolete.
 Used for the conceptual energy model. Amount that auto-generated shading will extend from auto-generated windows.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public double ShadeDepth { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property ShadeDepth As Double
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property double ShadeDepth {
	double get ();
	void set (double value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member ShadeDepth : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The shade depth is less than zero.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace